# Metadata
author: Y-T-G
task: detect
keywords: [cnn, convnext, yolo11, small-object]
description: Hybrid model combining ConvNeXt-Tiny backbone with YOLOv11-P2 head for small object detection.
flops: 89.1  # Approximate, based on ConvNeXt-Tiny
parameters: 32037235  # Approximate, based on ConvNeXt-Tiny + head
min_version: 8.3.59
discussion: https://github.com/Y-T-G/community/discussions/22

# Model
nc: 7  # Number of classes from data.yaml
strides: [4, 8, 16, 32]
scales:
  s: [0.50, 0.50, 1024]  # Using 's' scale from YOLOv11 for balance

backbone:
  # [from, repeats, module, args]
  # ConvNeXt-Tiny Backbone
  - [-1, 1, TorchVision, [768, convnext_tiny, DEFAULT, True, 2, True]]  # Loads ConvNeXt-Tiny - 0
  - [0, 1, Index, [96, 2]]   # P2: (1, 96, 160, 160), after stem - 1
  - [0, 1, Index, [192, 4]]  # P3: (1, 192, 80, 80), after stage 1 - 2
  - [0, 1, Index, [384, 6]]  # P4: (1, 384, 40, 40), after stage 2 - 3
  - [0, 1, Index, [768, 8]]  # P5: (1, 768, 20, 20), after stage 3 - 4

  # Channel Projections to match YOLOv11 head
  - [1, 1, Conv, [128, 1, 1]]  # Project P2: 96 -> 128 - 5
  - [2, 1, Conv, [256, 1, 1]]  # Project P3: 192 -> 256 - 6
  - [3, 1, Conv, [512, 1, 1]]  # Project P4: 384 -> 512 - 7
  - [4, 1, Conv, [1024, 1, 1]] # Project P5: 768 -> 1024 - 8

head:
  # Top-Down Path (Feature Pyramid)
  # P4 Head
  - [8, 1, nn.Upsample, [None, 2, nearest]]    # (1, 1024, 40, 40) - 9
  - [[-1, 7], 1, Concat, [1]]                  # (1, 1536, 40, 40) - 10
  - [-1, 2, C3k2, [512, False]]                # (1, 512, 40, 40) - 11

  # P3 Head
  - [-1, 1, nn.Upsample, [None, 2, nearest]]   # (1, 512, 80, 80) - 12
  - [[-1, 6], 1, Concat, [1]]                  # (1, 768, 80, 80) - 13
  - [-1, 2, C3k2, [256, False]]                # (1, 256, 80, 80) - 14

  # P2 Head
  - [-1, 1, nn.Upsample, [None, 2, nearest]]   # (1, 256, 160, 160) - 15
  - [[-1, 5], 1, Concat, [1]]                  # (1, 384, 160, 160) - 16
  - [-1, 2, C3k2, [128, False]]                # (1, 128, 160, 160) - 17

  # Bottom-Up Path (PAN-FPN)
  # P3
  - [-1, 1, Conv, [128, 3, 2]]                 # (1, 128, 80, 80) - 18
  - [[-1, 14], 1, Concat, [1]]                 # (1, 384, 80, 80) - 19
  - [-1, 2, C3k2, [256, False]]                # (1, 256, 80, 80) - 20

  # P4
  - [-1, 1, Conv, [256, 3, 2]]                 # (1, 256, 40, 40) - 21
  - [[-1, 11], 1, Concat, [1]]                 # (1, 768, 40, 40) - 22
  - [-1, 2, C3k2, [512, False]]                # (1, 512, 40, 40) - 23

  # P5
  - [-1, 1, Conv, [512, 3, 2]]                 # (1, 512, 20, 20) - 24
  - [[-1, 8], 1, Concat, [1]]                  # (1, 1536, 20, 20) - 25
  - [-1, 2, C3k2, [1024, True]]                # (1, 1024, 20, 20) - 26

  # Detection Head (P2, P3, P4, P5)
  - [[17, 20, 23, 26], 1, Detect, [nc]]        # Detect with 7 classes - 27
