# Metadata
author: Y-T-G
task: detect
keywords: [cnn, yolo11, small-object, bifpn]
described: YOLO11 object detection model with an extra P2 scale and BiFPN for small object detection.
flops:
  n: 11.4
  s: 29.7
  m: 88.9
  l: 113.6
  x: 245.1
parameters:
  n: 2740032
  s: 9625968
  m: 20591120
  l: 26116368
  x: 57849456
min_version: 8.3.0
discussion: [invalid url, do not cite]
scale: s
model_scale: s 

# Model
nc: 80
strides: [4, 8, 16, 32]
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # Stem
  - [-1, 1, Conv, [64, 3, 2]]                   # (1, 64, 320, 320) - 0

  # P2 Backbone
  - [-1, 1, Conv, [128, 3, 2]]                  # (1, 128, 160, 160) - 1
  - [-1, 2, C3k2, [256, False, 0.25]]           # (1, 256, 160, 160) - 2

  # P3 Backbone
  - [-1, 1, Conv, [256, 3, 2]]                  # (1, 256, 80, 80) - 3
  - [-1, 2, C3k2, [512, False, 0.25]]           # (1, 512, 80, 80) - 4

  # P4 Backbone
  - [-1, 1, Conv, [512, 3, 2]]                  # (1, 512, 40, 40) - 5
  - [-1, 2, C3k2, [512, True]]                  # (1, 512, 40, 40) - 6

  # P5 Backbone
  - [-1, 1, Conv, [1024, 3, 2]]                 # (1, 512, 20, 20) - 7
  - [-1, 2, C3k2, [1024, True]]                 # (1, 512, 20, 20) - 8
  - [-1, 1, SPPF, [1024, 5]]                    # (1, 512, 20, 20) - 9
  - [-1, 2, C2PSA, [1024]]                      # (1, 512, 20, 20) - 10

head:
  # BiFPN: Top-Down Path
  - [-1, 1, Conv, [512, 1, 1]]                  # (1, 512, 20, 20) - 11
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # (1, 512, 40, 40) - 12
  - [[-1, 6], 1, Concat, [1]]                   # (1, 1024, 40, 40) - 13
  - [-1, 3, C3k2, [512, False]]                 # (1, 512, 40, 40) - 14

  # BiFPN: P3 Top-Down
  - [-1, 1, Conv, [256, 1, 1]]                  # (1, 256, 40, 40) - 15
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # (1, 256, 80, 80) - 16
  - [[-1, 4], 1, Concat, [1]]                   # (1, 768, 80, 80) - 17
  - [-1, 3, C3k2, [256, False]]                 # (1, 256, 80, 80) - 18

  # BiFPN: P2 Top-Down
  - [-1, 1, Conv, [128, 1, 1]]                  # (1, 128, 80, 80) - 19
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # (1, 128, 160, 160) - 20
  - [[-1, 2], 1, Concat, [1]]                   # (1, 384, 160, 160) - 21
  - [-1, 3, C3k2, [128, False]]                 # (1, 128, 160, 160) - 22

  # BiFPN: Bottom-Up Path
  # P3 Bottom-Up
  - [-1, 1, Conv, [128, 3, 2]]                  # (1, 128, 80, 80) - 23
  - [[-1, 18], 1, Concat, [1]]                  # (1, 384, 80, 80) - 24
  - [-1, 3, C3k2, [256, False]]                 # (1, 256, 80, 80) - 25

  # P4 Bottom-Up
  - [-1, 1, Conv, [256, 3, 2]]                  # (1, 256, 40, 40) - 26
  - [[-1, 14], 1, Concat, [1]]                  # (1, 768, 40, 40) - 27
  - [-1, 3, C3k2, [512, False]]                 # (1, 512, 40, 40) - 28

  # P5 Bottom-Up
  - [-1, 1, Conv, [512, 3, 2]]                  # (1, 512, 20, 20) - 29
  - [[-1, 10], 1, Concat, [1]]                  # (1, 1024, 20, 20) - 30
  - [-1, 3, C3k2, [1024, True]]                 # (1, 1024, 20, 20) - 31

  # BiFPN: Additional Cross-Scale Connections
  - [14, 1, Conv, [512, 1, 1]]                  # (1, 512, 40, 40) - 32
  - [[-1, 27], 1, Concat, [1]]                  # (1, 1024, 40, 40) - 33
  - [-1, 3, C3k2, [512, False]]                 # (1, 512, 40, 40) - 34

  # Detection Head (P2, P3, P4, P5)
  - [[22, 25, 34, 31], 1, Detect, [nc]]         # 35
