# Metadata
author: Y-T-G
task: detect
keywords: [transformer, swin, fpn, yolo11, small-object]
description: Swin-T backbone with YOLOv11 PAN-FPN neck (including extra P2) and Detect head for 7 blood-cell classes
flops: 73.7
parameters: 40200397
min_version: 8.3.64

detect:
  nc: 7
  strides: [4, 8, 16, 32]  # P2, P3, P4, P5

# ---------------- Backbone ----------------
backbone:
  - [-1, 1, TorchVision, [768, swin_t, DEFAULT, True, 5, True]]    #  0: Swin-T backbone
  - [0, 1, Index, [192, 4]]                                        #  1: stage2 → P2 features
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]]
  - [0, 1, Index, [384, 6]]                                        #  3: stage3 → P3 features
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]]
  - [0, 1, Index, [768, 8]]                                        #  5: stage4 → P4 features
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]]
  - [-1, 1, SPPF, [768, 5]]                                        #  7: stage5 → P5 features

# ---------------- Neck (PAN-FPN) ----------------
pan_fpn:
  # Top-Down Path
  - [-1, 1, nn.Upsample, [None, 2, nearest]]  # P5→P4
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [384, False]]

  - [-1, 1, nn.Upsample, [None, 2, nearest]]  # P4→P3
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [192, False]]

  - [-1, 1, nn.Upsample, [None, 2, nearest]]  # P3→P2
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 2, C3k2, [96, False]]  # P2 branch

  # Bottom-Up Path
  - [-1, 1, Conv, [96, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [192, False]]

  - [-1, 1, Conv, [192, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [384, False]]

  - [-1, 1, Conv, [384, 3, 2]]
  - [[-1, 7], 1, Concat, [1]]
  - [-1, 2, C3k2, [768, True]]

# ---------------- Head (Detect) ----------------
detect_head:
  - [[16, 19, 22, 25], 1, Detect, [nc]]  # P2,P3,P4,P5
