# Metadata
author: Y-T-G
task: detect
keywords: [transformer, swin, fpn, yolo11, small-object]
description: Swin-T backbone with YOLOv11 PAN-FPN neck (including extra P2) and Detect head for 7 blood-cell classes
flops: 73.7
parameters: 40200397
min_version: 8.3.64

# Model
nc: 7
scale: n
scales:
  n: [0.50, 0.25, 1024]  # YOLOv11-n (nano model)

# ---------------- Backbone ----------------
backbone:
  - [-1, 1, SwinTransformer, ['swin_tiny', True, [2, 3, 4]]]  # outputs P3, P4, P5

# ---------------- Head ----------------
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]
  - [[16, 19, 22], 1, Detect, [nc]]  # Detect on P3, P4, P5
